---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepOffsetParam
source: html/dbae683b-d19b-2fd6-b37f-0d995edfc8e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepOffsetParam Property

"Offset From Level"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepOffsetParam { get; }
```